03. perpustakaan/src/main/resources/request/createdBook.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:gs="http://www.polstat.com/perpustakaan/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:createBookRequest>
            <gs:book>
                <gs:title>Testing</gs:title>
                <gs:author>Rayfa</gs:author>
                <gs:description>Percobaan</gs:description>
            </gs:book>
        </gs:createBookRequest>
    </soapenv:Body>
</soapenv:Envelope>